pkwasniok/avr-db-template/lib/atpack/edc/AVR32DU20.PIC
        <edc:SFRDef ltx:memberofperipheral="TCB1" edc:cname="INTFLAGS" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0xB16">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB1">
              <edc:SFRFieldDef edc:cname="CAPT" edc:nzwidth="0x1" edc:desc="Capture or Timeout"/>
              <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCB1" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="-------r" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0xB17">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB1">
              <edc:SFRFieldDef edc:cname="RUN" edc:nzwidth="0x1" edc:desc="Run"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCB1" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0xB18">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB1">
              <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Debug Run"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCB1" edc:cname="TEMP" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xB19"/>
        <edc:SFRDef ltx:memberofperipheral="TCB1" edc:cname="CNT" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0xB1A"/>
        <edc:SFRDef ltx:memberofperipheral="TCB1" edc:cname="CCMP" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xB1C"/>
        <edc:AdjustPoint edc:offset="0xE2" edc:_addr="0xB1E"/>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="n-nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xBF" edc:_addr="0xC00">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="MAXEP" edc:nzwidth="0x4" edc:desc="Maximum Endpoint Address"/>
              <edc:SFRFieldDef edc:cname="STFRNUM" edc:nzwidth="0x1" edc:desc="Store Frame Number Enable"/>
              <edc:SFRFieldDef edc:cname="FIFOEN" edc:nzwidth="0x1" edc:desc="Transaction Complete FIFO Enable"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="USB Enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="CTRLB" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0xC01">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="ATTACH" edc:nzwidth="0x1" edc:desc="Attach"/>
              <edc:SFRFieldDef edc:cname="GNAK" edc:nzwidth="0x1" edc:desc="Respond with NAK on all Endpoints"/>
              <edc:SFRFieldDef edc:cname="GNAUTO" edc:nzwidth="0x1" edc:desc="Set GNAK Automatically after SETUP"/>
              <edc:SFRFieldDef edc:cname="URESUME" edc:nzwidth="0x1" edc:desc="Send Upstream Resume"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="BUSSTATE" edc:nzwidth="0x8" edc:access="---rrrrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1F" edc:_addr="0xC02">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="BUSRST" edc:nzwidth="0x1" edc:desc="Bus Reset"/>
              <edc:SFRFieldDef edc:cname="SUSPENDED" edc:nzwidth="0x1" edc:desc="Bus Suspended"/>
              <edc:SFRFieldDef edc:cname="DRESUME" edc:nzwidth="0x1" edc:desc="Downstram Resume"/>
              <edc:SFRFieldDef edc:cname="URESUME" edc:nzwidth="0x1" edc:desc="Upstream Resume"/>
              <edc:SFRFieldDef edc:cname="WTRSM" edc:nzwidth="0x1" edc:desc="Wait Time Resume"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="ADDR" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:_addr="0xC03">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x7" edc:desc="Device Address"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="FIFOWP" edc:nzwidth="0x8" edc:access="---nnnnn" edc:por="11111111" edc:mclr="11111111" edc:impl="0x1F" edc:_addr="0xC04">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="FIFOWP" edc:nzwidth="0x5" edc:desc="FIFO Write Pointer"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="FIFORP" edc:nzwidth="0x8" edc:access="---nnnnn" edc:por="11111111" edc:mclr="11111111" edc:impl="0x1F" edc:_addr="0xC05">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="FIFORP" edc:nzwidth="0x5" edc:desc="FIFO Read Pointer"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="EPPTR" edc:nzwidth="0x10" edc:access="rrrrrrrrrrrrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0xC06">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="EPPTR" edc:nzwidth="0x10" edc:desc="Endpoint Configuration Table Pointer"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="INTCTRLA" edc:nzwidth="0x8" edc:access="nnnnnnn-" edc:por="00000000" edc:mclr="00000000" edc:impl="0xFE" edc:_addr="0xC08">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="UNF" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="STALLED" edc:nzwidth="0x1" edc:desc="STALL Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="RESET" edc:nzwidth="0x1" edc:desc="Reset Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="RESUME" edc:nzwidth="0x1" edc:desc="Resume Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="SUSPEND" edc:nzwidth="0x1" edc:desc="Suspend Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="SOF" edc:nzwidth="0x1" edc:desc="Start Of Frame Interrupt Enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="INTCTRLB" edc:nzwidth="0x8" edc:access="--n---nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x23" edc:_addr="0xC09">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="SETUP" edc:nzwidth="0x1" edc:desc="SETUP Transaction Complete Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="GNDONE" edc:nzwidth="0x1" edc:desc="GNAK Operation Done Interrupt Enable"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="TRNCOMPL" edc:nzwidth="0x1" edc:desc="Transaction Complete Interrupt Enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="INTFLAGSA" edc:nzwidth="0x8" edc:access="nnnnnnn-" edc:por="00000000" edc:mclr="00000000" edc:impl="0xFE" edc:_addr="0xC0A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Flag"/>
              <edc:SFRFieldDef edc:cname="UNF" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Flag"/>
              <edc:SFRFieldDef edc:cname="STALLED" edc:nzwidth="0x1" edc:desc="STALL Interrupt Flag"/>
              <edc:SFRFieldDef edc:cname="RESET" edc:nzwidth="0x1" edc:desc="Reset Interrupt Flag"/>
              <edc:SFRFieldDef edc:cname="RESUME" edc:nzwidth="0x1" edc:desc="Resume Interrupt Flag"/>
              <edc:SFRFieldDef edc:cname="SUSPEND" edc:nzwidth="0x1" edc:desc="Suspend Interrupt Flag"/>
              <edc:SFRFieldDef edc:cname="SOF" edc:nzwidth="0x1" edc:desc="Start Of Frame Interrupt Flag"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="INTFLAGSB" edc:nzwidth="0x8" edc:access="--n--nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x27" edc:_addr="0xC0B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="SETUP" edc:nzwidth="0x1" edc:desc="SETUP Transaction Complete Interrupt Flag"/>
              <edc:SFRFieldDef edc:cname="GNDONE" edc:nzwidth="0x1" edc:desc="GNAK Operation Done Interrupt Flag"/>
              <edc:SFRFieldDef edc:cname="RMWBUSY" edc:nzwidth="0x1" edc:desc="RMW Busy Flag"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TRNCOMPL" edc:nzwidth="0x1" edc:desc="Transaction Complete Interrupt Flag"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x34" edc:_addr="0xC0C"/>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS0OUTCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xC40">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
