pkwasniok/avr-db-template/lib/atpack/edc/AVR32DU20.PIC
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x1053"/>
        <edc:DCRDef ltx:memberofperipheral="FUSE" edc:cname="SYSCFG0" edc:nzwidth="0x8" edc:impl="0xFB" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0xD0" edc:access="nnnnn-nn" edc:_addr="0x1055">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="EESAVE" edc:nzwidth="0x1" edc:desc="EEPROM Save">
                <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="BROWSAVE" edc:nzwidth="0x1" edc:desc="Boot Row Save">
                <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
                <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
              </edc:DCRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:DCRFieldDef edc:cname="RSTPINCFG" edc:nzwidth="0x1" edc:desc="Reset Pin Configuration">
                <edc:DCRFieldSemantic edc:cname="GPIO" edc:desc="GPIO mode" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="RST" edc:desc="Reset mode" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="UPDIPINCFG" edc:nzwidth="0x1" edc:desc="UPDI Pin Configuration">
                <edc:DCRFieldSemantic edc:cname="GPIO" edc:desc="GPIO Mode" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="UPDI" edc:desc="UPDI Mode" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="CRCSEL" edc:nzwidth="0x1" edc:desc="CRC Select">
                <edc:DCRFieldSemantic edc:cname="CRC16" edc:desc="Enable CRC16" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="CRC32" edc:desc="Enable CRC32" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="CRCSRC" edc:nzwidth="0x2" edc:desc="CRC Source">
                <edc:DCRFieldSemantic edc:cname="FLASH" edc:desc="CRC of full Flash (boot, application code and application data)" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="BOOT" edc:desc="CRC of boot section" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="BOOTAPP" edc:desc="CRC of application code and boot sections" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:DCRFieldSemantic edc:cname="NOCRC" edc:desc="No CRC" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:DCRDef ltx:memberofperipheral="FUSE" edc:cname="SYSCFG1" edc:nzwidth="0x8" edc:impl="0xF" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x08" edc:access="----nnnn" edc:_addr="0x1056">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="SUT" edc:nzwidth="0x3" edc:desc="Startup Time">
                <edc:DCRFieldSemantic edc:cname="0MS" edc:desc="0 ms" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="1MS" edc:desc="1 ms" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="2MS" edc:desc="2 ms" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:DCRFieldSemantic edc:cname="4MS" edc:desc="4 ms" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:DCRFieldSemantic edc:cname="8MS" edc:desc="8 ms" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:DCRFieldSemantic edc:cname="16MS" edc:desc="16 ms" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:DCRFieldSemantic edc:cname="32MS" edc:desc="32 ms" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:DCRFieldSemantic edc:cname="64MS" edc:desc="64 ms" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:DCRFieldDef>
              <edc:DCRFieldDef edc:cname="USBSINK" edc:nzwidth="0x1" edc:desc="USB Voltage Regulator Current Sink Enable">
                <edc:DCRFieldSemantic edc:cname="DISABLE" edc:desc="USB VREG can not sink current" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="ENABLE" edc:desc="USB VREG can sink current" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:DCRDef ltx:memberofperipheral="FUSE" edc:cname="CODESIZE" edc:nzwidth="0x8" edc:impl="0xFF" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x00" edc:access="nnnnnnnn" edc:_addr="0x1057">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="CODESIZE" edc:nzwidth="0x8" edc:desc="Code Section Size"/>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:DCRDef ltx:memberofperipheral="FUSE" edc:cname="BOOTSIZE" edc:nzwidth="0x8" edc:impl="0xFF" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x00" edc:access="nnnnnnnn" edc:_addr="0x1058">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="BOOTSIZE" edc:nzwidth="0x8" edc:desc="Boot Section Size"/>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x1059"/>
        <edc:DCRDef ltx:memberofperipheral="FUSE" edc:cname="PDICFG" edc:nzwidth="0x10" edc:impl="0xFFF3" edc:unused="0x0" edc:useinchecksum="0xFFFF" edc:factorydefault="0x0003" edc:access="nnnnnnnnnnnn--nn" edc:_addr="0x105A">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
              <edc:DCRFieldDef edc:cname="LEVEL" edc:nzwidth="0x2" edc:desc="Protection Level">
                <edc:DCRFieldSemantic edc:cname="NVMACCDIS" edc:desc="NVM Access through UPDI disabled" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:DCRFieldSemantic edc:cname="BASIC" edc:desc="UPDI and UPDI pins working normally" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:DCRFieldDef>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:DCRFieldDef edc:cname="KEY" edc:nzwidth="0xC" edc:desc="NVM Protection Activation Key">
                <edc:DCRFieldSemantic edc:cname="NOTACT" edc:desc="Not Active" edc:when="(field &amp; 0xFFF) == 0x00"/>
                <edc:DCRFieldSemantic edc:cname="NVMACT" edc:desc="NVM Protection Active" edc:when="(field &amp; 0xFFF) == 0xB45"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
      </edc:ConfigFuseSector>
      <edc:DeviceIDSector edc:regionid="SIGNATURES" edc:beginaddr="0x1080" edc:endaddr="0x1083" atdf:pagesize="0x80" edc:value="0x1E954E" edc:mask="0xffffff" edc:rw="r">
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="DEVICEID0" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x1080"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="DEVICEID1" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x1081"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="DEVICEID2" edc:nzwidth="0x8" edc:impl="0x0" edc:unused="0x0" edc:useinchecksum="0xFF" edc:factorydefault="0x0" edc:access="rrrrrrrr" edc:_addr="0x1082"/>
      </edc:DeviceIDSector>
      <edc:DeviceIDSector edc:regionid="PROD_SIGNATURES" edc:beginaddr="0x1083" edc:endaddr="0x1100" atdf:pagesize="0x80" edc:value="0x1E954E" edc:mask="0xffffff" edc:rw="r">
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x1083"/>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="TEMPSENSE0" edc:nzwidth="0x10" edc:impl="0xFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFF" edc:factorydefault="0x0" edc:access="rrrrrrrrrrrrrrrr" edc:_addr="0x1084">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="SIGROW">
              <edc:DCRFieldDef edc:cname="TEMPSENSE0" edc:nzwidth="0x10" edc:desc="Temperature Calibration 0"/>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:DCRDef ltx:memberofperipheral="SIGROW" edc:cname="TEMPSENSE1" edc:nzwidth="0x10" edc:impl="0xFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFF" edc:factorydefault="0x0" edc:access="rrrrrrrrrrrrrrrr" edc:_addr="0x1086">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="SIGROW">
              <edc:DCRFieldDef edc:cname="TEMPSENSE1" edc:nzwidth="0x10" edc:desc="Temperature Calibration 1"/>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
