pkwasniok/avr-db-template/lib/atpack/edc/AVR32DU20.PIC
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW149" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1195"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW150" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1196"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW151" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1197"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW152" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1198"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW153" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1199"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW154" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x119A"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW155" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x119B"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW156" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x119C"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW157" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x119D"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW158" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x119E"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW159" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x119F"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW160" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11A0"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW161" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11A1"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW162" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11A2"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW163" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11A3"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW164" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11A4"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW165" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11A5"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW166" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11A6"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW167" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11A7"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW168" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11A8"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW169" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11A9"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW170" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11AA"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW171" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11AB"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW172" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11AC"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW173" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11AD"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW174" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11AE"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW175" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11AF"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW176" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11B0"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW177" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11B1"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW178" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11B2"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW179" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11B3"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW180" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11B4"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW181" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11B5"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW182" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11B6"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW183" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11B7"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW184" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11B8"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW185" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11B9"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW186" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11BA"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW187" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11BB"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW188" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11BC"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW189" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11BD"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW190" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11BE"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW191" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11BF"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW192" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11C0"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW193" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11C1"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW194" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11C2"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW195" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11C3"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW196" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11C4"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW197" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11C5"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW198" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11C6"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW199" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11C7"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW200" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11C8"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW201" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11C9"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW202" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11CA"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW203" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11CB"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW204" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11CC"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW205" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11CD"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW206" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11CE"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW207" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11CF"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW208" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11D0"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW209" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11D1"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW210" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11D2"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW211" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11D3"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW212" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11D4"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW213" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11D5"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW214" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11D6"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW215" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11D7"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW216" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11D8"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW217" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11D9"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW218" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11DA"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW219" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11DB"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW220" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11DC"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW221" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11DD"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW222" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11DE"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW223" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11DF"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW224" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11E0"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW225" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11E1"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW226" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11E2"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW227" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11E3"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW228" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11E4"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW229" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11E5"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW230" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11E6"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW231" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11E7"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW232" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11E8"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW233" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11E9"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW234" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11EA"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW235" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11EB"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW236" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11EC"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW237" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11ED"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW238" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11EE"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW239" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11EF"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW240" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11F0"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW241" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11F1"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW242" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11F2"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW243" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11F3"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW244" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11F4"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW245" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11F5"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW246" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11F6"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW247" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11F7"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW248" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11F8"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW249" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11F9"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW250" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11FA"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW251" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11FB"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW252" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11FC"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW253" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11FD"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW254" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11FE"/>
        <edc:SFRDef ltx:memberofperipheral="BOOTROW" edc:cname="BOOTROW255" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x11FF"/>
      </edc:UserIDSector>
      <edc:UserIDSector edc:regionid="USER_SIGNATURES" edc:beginaddr="0x1200" edc:endaddr="0x1400" edc:magicoffset="0x850000" atdf:pagesize="0x200" edc:rw="rw">
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW0" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1200"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW1" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1201"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW2" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1202"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW3" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1203"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW4" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1204"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW5" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1205"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW6" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1206"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW7" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1207"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW8" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1208"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW9" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1209"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW10" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x120A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW11" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x120B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW12" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x120C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW13" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x120D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW14" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x120E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW15" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x120F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW16" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1210"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW17" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1211"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW18" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1212"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW19" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1213"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW20" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1214"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW21" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1215"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW22" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1216"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW23" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1217"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW24" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1218"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW25" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1219"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW26" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x121A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW27" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x121B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW28" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x121C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW29" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x121D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW30" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x121E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW31" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x121F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW32" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1220"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW33" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1221"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW34" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1222"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW35" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1223"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW36" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1224"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW37" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1225"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW38" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1226"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW39" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1227"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW40" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1228"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW41" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1229"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW42" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x122A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW43" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x122B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW44" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x122C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW45" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x122D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW46" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x122E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW47" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x122F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW48" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1230"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW49" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1231"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW50" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1232"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW51" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1233"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW52" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1234"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW53" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1235"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW54" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1236"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW55" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1237"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW56" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1238"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW57" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1239"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW58" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x123A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW59" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x123B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW60" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x123C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW61" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x123D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW62" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x123E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW63" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x123F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW64" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1240"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW65" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1241"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW66" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1242"/>
